# 20223015이정욱

학번<-c(101,102,103,104,105)
이름<-c('홍길동','이몽룡','성춘향','변사또','향단이')
나이<-c(19, 20, 19, 21, 20)
(student<-data.frame(학번=학번,이름=이름,나이=나이))  #데이터프레임 student생성



학번<-c(101,105,103,107,108,109,110,111,112,113)
동아리이름<-c('야구','야구','농구','농구','농구','축구','축구','축구','배구','배구')
동아리방번호<-c(3, 5, 6, 1, 21, 8, 2, 13, 9, 11)
(club<-data.frame(학번=학번,동아리이름=동아리이름,동아리방번호=동아리방번호))  #데이터프레임 club생성


A<-merge(student,club,by='학번',all=FALSE)  #'학번'을 통해 student와 club결합
A



A[A$나이>='20', ]  #A에서 나이가 20 이상인 학생을 추출


B<-merge(student,club,all=TRUE)  #결합후, 동아리에 가입되지 않은 학생은 NA처리
B